app/controllers/projects_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
    def index
        @projects = TodoList.all

SELECT "todo_lists".* FROM "todo_lists"
---
    def projects_labels
        @projects = TodoList.all

INSERT INTO "todos" ("text", "isCompleted", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "FIRST add"], ["isCompleted", nil], ["todo_list_id", 1], ["created_at", "2022-07-07 23:07:47.142936"], ["updated_at", "2022-07-07 23:07:47.142936"]]
---
    def create_todo
        @todo = Todo.new(todo_list_id: params[:todo_list_id], text: params[:text], isCompleted: params[:isCompleted])

        if @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."todo_list_id" = $1 AND "todos"."id" = $2 LIMIT $3  [["todo_list_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "text" = $1, "isCompleted" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["text", "NEW UPDATE 2022"], ["isCompleted", true], ["updated_at", "2022-07-08 02:12:29.900484"], ["id", 27]]
---
    def update_todo
        @todo = Todo.where(todo_list_id: params[:projectId]).find_by(id: params[:todoId])

        if @todo.update(todo_update_params)